In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### Series

In [6]:
s1 = Series(np.random.randn(6), index=[['1', '1', '1', '2', '2', '2'], ['a', 'b', 'c', 'a', 'b', 'c']])

In [7]:
s1

1  a    0.227699
   b   -0.137033
   c   -0.233315
2  a    0.201417
   b    0.683764
   c    0.693293
dtype: float64

In [9]:
s1['1']

a    0.227699
b   -0.137033
c   -0.233315
dtype: float64

In [10]:
s1['1']['a']

0.22769876479819515

In [11]:
s1[:, 'a']

1    0.227699
2    0.201417
dtype: float64

In [12]:
# 多级Series 向 DataFrame 转换
df1 = s1.unstack()

In [14]:
df1

          a         b         c
1  0.227699 -0.137033 -0.233315
2  0.201417  0.683764  0.693293

In [16]:
df2 = DataFrame([s1['1'], s1['2']])

In [17]:
df2

          a         b         c
0  0.227699 -0.137033 -0.233315
1  0.201417  0.683764  0.693293

In [15]:
# DataFrame 向 多级Series 进行转换

In [18]:
s2 = df1.unstack()

In [20]:
s2

a  1    0.227699
   2    0.201417
b  1   -0.137033
   2    0.683764
c  1   -0.233315
   2    0.693293
dtype: float64

In [22]:
s1

1  a    0.227699
   b   -0.137033
   c   -0.233315
2  a    0.201417
   b    0.683764
   c    0.693293
dtype: float64

In [23]:
# 转置重新构建s2
s2 = df1.T.unstack()

In [25]:
s2

1  a    0.227699
   b   -0.137033
   c   -0.233315
2  a    0.201417
   b    0.683764
   c    0.693293
dtype: float64

In [31]:
# 多级DataFrame
df = DataFrame(np.arange(16).reshape([4, 4]), index=[['a','a','b','b'], [1,2,1,2]], columns=[['BJ','BJ','SH','GZ'], ['A','B','C','D']])

In [33]:
df

     BJ      SH  GZ
      A   B   C   D
a 1   0   1   2   3
  2   4   5   6   7
b 1   8   9  10  11
  2  12  13  14  15

In [35]:
df['BJ']

      A   B
a 1   0   1
  2   4   5
b 1   8   9
  2  12  13

In [36]:
df['BJ']['A']

a  1     0
   2     4
b  1     8
   2    12
Name: A, dtype: int32